In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df1=pd.DataFrame({'ID':[1,2,3,4],
                 'NAME':['A','B','C','D'],
                 'SUB':['SUB1','SUB2','SUB3','SUB4']})

In [4]:
df1

   ID NAME   SUB
0   1    A  SUB1
1   2    B  SUB2
2   3    C  SUB3
3   4    D  SUB4

In [5]:
df2=pd.DataFrame({'ID':[1,2,3,4],
                 'NAME':['E','F','G','H'],
                 'SUB':['SUB3','SUB4','SUB5','SUB6']})

In [6]:
df2

   ID NAME   SUB
0   1    E  SUB3
1   2    F  SUB4
2   3    G  SUB5
3   4    H  SUB6

In [7]:
pd.concat([df1,df2],axis=0).reset_index()

   index  ID NAME   SUB
0      0   1    A  SUB1
1      1   2    B  SUB2
2      2   3    C  SUB3
3      3   4    D  SUB4
4      0   1    E  SUB3
5      1   2    F  SUB4
6      2   3    G  SUB5
7      3   4    H  SUB6

In [8]:
pd.concat([df1,df2],axis=1)

   ID NAME   SUB  ID NAME   SUB
0   1    A  SUB1   1    E  SUB3
1   2    B  SUB2   2    F  SUB4
2   3    C  SUB3   3    G  SUB5
3   4    D  SUB4   4    H  SUB6

In [9]:
pd.merge(left=df1,right=df2,on='SUB')

   ID_x NAME_x   SUB  ID_y NAME_y
0     3      C  SUB3     1      E
1     4      D  SUB4     2      F

In [10]:
pd.merge(left=df1,right=df2,on='SUB',how='left')

   ID_x NAME_x   SUB  ID_y NAME_y
0     1      A  SUB1   NaN    NaN
1     2      B  SUB2   NaN    NaN
2     3      C  SUB3   1.0      E
3     4      D  SUB4   2.0      F

In [11]:
pd.merge(left=df1,right=df2,on='SUB',how='right')

   ID_x NAME_x   SUB  ID_y NAME_y
0   3.0      C  SUB3     1      E
1   4.0      D  SUB4     2      F
2   NaN    NaN  SUB5     3      G
3   NaN    NaN  SUB6     4      H

In [12]:
pd.merge(left=df1,right=df2,on='SUB',how='outer')

   ID_x NAME_x   SUB  ID_y NAME_y
0   1.0      A  SUB1   NaN    NaN
1   2.0      B  SUB2   NaN    NaN
2   3.0      C  SUB3   1.0      E
3   4.0      D  SUB4   2.0      F
4   NaN    NaN  SUB5   3.0      G
5   NaN    NaN  SUB6   4.0      H

In [13]:
df3=pd.DataFrame({'ID':[1],
                 'Employee_Name':'I',
                 'SUB':'SUB7'})

In [14]:
df3

   ID Employee_Name   SUB
0   1             I  SUB7

In [15]:
df4=df1.append(df3)

In [16]:
df4.reset_index(inplace=True)
df4

   index  ID NAME   SUB Employee_Name
0      0   1    A  SUB1           NaN
1      1   2    B  SUB2           NaN
2      2   3    C  SUB3           NaN
3      3   4    D  SUB4           NaN
4      0   1  NaN  SUB7             I

In [17]:
df4.drop('index',inplace=True,axis=1)
df4

   ID NAME   SUB Employee_Name
0   1    A  SUB1           NaN
1   2    B  SUB2           NaN
2   3    C  SUB3           NaN
3   4    D  SUB4           NaN
4   1  NaN  SUB7             I

In [18]:
market_df=pd.read_csv('C:\\Users\\sree\\Desktop\\jupyter\\data science\\supermarkets\\supermarkets.csv')
market_df

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [19]:
market_df['Employees']>15

0    False
1    False
2     True
3    False
4    False
5     True
Name: Employees, dtype: bool

In [20]:
market_df[market_df['Employees']>=15]

,ID,Address,City,State,Country,Name,Employees
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [21]:
market_df[market_df['State']=='CA 94114']

   ID          Address           City     State Country        Name  Employees
0   1     3666 21st St  San Francisco  CA 94114     USA     Madeira          8
3   4     3995 23rd St  San Francisco  CA 94114     USA  Ben's Shop         10
5   6  551 Alvarado St  San Francisco  CA 94114     USA  Richvalley         20

In [22]:
market_df[(market_df['State']=='CA 94114')&(market_df['Employees']>=15)]

   ID          Address           City     State Country        Name  Employees
5   6  551 Alvarado St  San Francisco  CA 94114     USA  Richvalley         20

In [23]:
market_df[(market_df['State']=='CA 94114')|(market_df['Employees']>=15)]

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [24]:
market_df[(market_df['State']=='CA 94114')&~(market_df['Employees']>=15)]

   ID       Address           City     State Country        Name  Employees
0   1  3666 21st St  San Francisco  CA 94114     USA     Madeira          8
3   4  3995 23rd St  San Francisco  CA 94114     USA  Ben's Shop         10

In [25]:
new_tuple=[('Suma','Subject1'),('Suma','Subject2'),
          ('Hima','Subject1'),('Hima','Subject2'),
          ('Nani','Subject1'),('Nani','Subject2')]

In [26]:
index=pd.MultiIndex.from_tuples(new_tuple)

In [27]:
Values=[['Suma','Subject1','Science',98],['Suma','Subject2','Maths',99],
       ['Hima','Subject1','Science',95],['Hima','Subject2','Maths',90],
       ['Nani','Subject1','Science',90],['Nani','Subject2','Maths',89]]

In [28]:
marks_df=pd.DataFrame(Values,columns=['Name','Subject','Subject_Name','Marks'])

In [29]:
marks_df

   Name   Subject Subject_Name  Marks
0  Suma  Subject1      Science     98
1  Suma  Subject2        Maths     99
2  Hima  Subject1      Science     95
3  Hima  Subject2        Maths     90
4  Nani  Subject1      Science     90
5  Nani  Subject2        Maths     89

In [30]:
marks_df.set_index(['Name','Subject'])

              Subject_Name  Marks
Name Subject
Suma Subject1      Science     98
     Subject2        Maths     99
Hima Subject1      Science     95
     Subject2        Maths     90
Nani Subject1      Science     90
     Subject2        Maths     89

In [31]:
pip install seaborn

Requirement already satisfied: seaborn in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (0.11.0)
Requirement already satisfied: numpy>=1.15 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.19.0)
Requirement already satisfied: matplotlib>=2.2 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (3.3.1)
Requirement already satisfied: scipy>=1.0 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.5.2)
Requirement already satisfied: pandas>=0.23 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from seaborn) (1.0.5)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (1.2.0)
Requirement already satisfied: certifi>=2020.06.20 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (2020.6.20)
Requirement already satisfied: cycler>=0.10 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from matplotlib>=2.2->seaborn) (7.2.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from pandas>=0.23->seaborn) (2020.1)
Requirement already satisfied: six in c:\users\sree\appdata\local\programs\python\python38-32\lib\site-packages (from cycler>=0.10->matplotlib>=2.2->seaborn) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [32]:
import seaborn as sns

In [33]:
tips=sns.load_dataset('tips')

In [34]:
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [35]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.0 KB

In [36]:
tips['sex'].unique()

[Female, Male]
Categories (2, object): [Female, Male]

In [37]:
tips['time'].unique()

[Dinner, Lunch]
Categories (2, object): [Dinner, Lunch]

In [38]:
tips[(tips.time=='Dinner')]['tip'].sum()

546.0699999999999

In [39]:
tips[(tips.time=='Lunch')]['tip'].sum()

185.51000000000002

In [40]:
tips[(tips.time=='Dinner')]['tip'].mean()

3.102670454545454

In [41]:
tips[(tips.time=='Lunch')]['tip'].mean()

2.728088235294118

In [42]:
tips[(tips.time=='Morning')]['tip'].sum()

0.0

In [43]:
tips[(tips.time=='Morning')]

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

In [44]:
tips[tips.sex=='Female']['tip'].mean()

2.8334482758620685

In [45]:
tips[(tips.sex)=='Male']['tip'].mean()

3.0896178343949043

In [46]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [47]:
tips['tip'].mean()/tips['total_bill'].mean()

0.15153580224410027

In [48]:
tips[tips.time=='Lunch'].mean()

total_bill    17.168676
tip            2.728088
size           2.411765
dtype: float64

In [49]:
tips[tips.time=='Dinner']['tip'].mean()

3.102670454545454

In [50]:
tips[tips['time']=='Dinner']['tip'].mean()/tips[tips['time']=='Lunch']['tip'].mean()

1.137305756611993

In [51]:
tips['tip'].std()

1.3836381890011822

In [52]:
tips['tip'].head(10).std()

1.1150331335385908

In [53]:
tips['tip'].max()

10.0

In [54]:
tips['tip'].skew()

1.4654510370979401

In [55]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [56]:
tips[tips['size']>1]['tip'].mean()/tips[tips['size']==1]['tip'].mean()

2.1038550724637686

In [57]:
tips['tip_per']=tips['tip']/tips['total_bill']

In [58]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   tip_per     244 non-null    float64
dtypes: category(4), float64(3), int64(1)
memory usage: 8.9 KB

In [59]:
tips.head(10)

   total_bill   tip     sex smoker  day    time  size   tip_per
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240
6        8.77  2.00    Male     No  Sun  Dinner     2  0.228050
7       26.88  3.12    Male     No  Sun  Dinner     4  0.116071
8       15.04  1.96    Male     No  Sun  Dinner     2  0.130319
9       14.78  3.23    Male     No  Sun  Dinner     2  0.218539

In [60]:
tips[tips['size']==1]['tip_per'].mean()/tips[tips['size']>1]['tip_per'].mean()

1.3592551752954416

In [61]:
tips[tips['sex']=='Female']['tip_per'].mean()/tips[tips['sex']=='Male']['tip_per'].mean()

1.056074587070011

In [62]:
tips.count()

total_bill    244
tip           244
sex           244
smoker        244
day           244
time          244
size          244
tip_per       244
dtype: int64

In [64]:
tips[tips['sex']=='Female']['sex'].count()/244

0.35655737704918034

In [65]:
multiindex_df=pd.DataFrame({'Company':['Google','Google','Google','Microsoft','Microsoft','Microsoft'],
                          'Year':[2008,2009,2010,2008,2009,2010],
                          'Employees':[240,541,342,491,650,444],
                           'Revenue':[300,400,500,600,700,800]})

In [66]:
multiindex_df.set_index(['Company','Year'], inplace=True)

In [67]:
multiindex_df

                Employees  Revenue
Company   Year
Google    2008        240      300
          2009        541      400
          2010        342      500
Microsoft 2008        491      600
          2009        650      700
          2010        444      800

In [68]:
multiindex_df.xs(2008,level='Year')

           Employees  Revenue
Company
Google           240      300
Microsoft        491      600

In [75]:
multiindex_df.xs(2009,level='Year')[['Employees']].loc[['Google','Microsoft']]

           Employees
Company
Google           541
Microsoft        650

In [76]:
multiindex_df.xs(2009,level='Year').loc[['Google'],['Revenue']]

         Revenue
Company
Google       400

In [77]:
multiindex_df.xs(2009,level='Year')[['Revenue','Employees']]

           Revenue  Employees
Company
Google         400        541
Microsoft      700        650

In [88]:
multiindex_df.xs(2009,level='Year').iloc[[0],[1]]

         Revenue
Company
Google       400

In [98]:
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_per
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [99]:
tips['time'].unique()

[Dinner, Lunch]
Categories (2, object): [Dinner, Lunch]

In [100]:
tips['time'].nunique()

2

In [89]:
tips['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [90]:
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_per
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [91]:
bysmoker=tips.groupby('smoker').mean()

In [92]:
bysmoker

        total_bill       tip      size   tip_per
smoker
Yes      20.756344  3.008710  2.408602  0.163196
No       19.188278  2.991854  2.668874  0.159328

In [95]:
bysex=tips.groupby('sex')[['total_bill']].mean()

In [96]:
bysex

        total_bill
sex
Male     20.744076
Female   18.056897

In [116]:
byday=tips.groupby('day').mean()

In [117]:
byday

      total_bill       tip      size   tip_per
day
Thur   17.682742  2.771452  2.451613  0.161276
Fri    17.151579  2.734737  2.105263  0.169913
Sat    20.441379  2.993103  2.517241  0.153152
Sun    21.410000  3.255132  2.842105  0.166897

In [118]:
bysex=tips.groupby('sex').mean()

In [119]:
bysex

        total_bill       tip      size   tip_per
sex
Male     20.744076  3.089618  2.630573  0.157651
Female   18.056897  2.833448  2.459770  0.166491

In [97]:
byday=tips[tips['sex']=='Female'].groupby('day').mean()

In [98]:
byday['BillPerPerson']=byday['total_bill']/byday['size']

In [99]:
byday

      total_bill       tip      size   tip_per  BillPerPerson
day
Thur   16.715312  2.575625  2.468750  0.157525       6.770759
Fri    14.145556  2.781111  2.111111  0.199388       6.700526
Sat    19.680357  2.801786  2.250000  0.156470       8.746825
Sun    19.872222  3.367222  2.944444  0.181569       6.749057

In [100]:
def sqof6multiples(num):
    x=num
    if x%6==0:
        num **= 2
    return num

In [101]:
multiindex_df['Revenue'].apply(sqof6multiples)

Company    Year
Google     2008     90000
           2009       400
           2010       500
Microsoft  2008    360000
           2009       700
           2010       800
Name: Revenue, dtype: int64

In [102]:
multiindex_df['Revenue'].apply(lambda x: x*2)

Company    Year
Google     2008     600
           2009     800
           2010    1000
Microsoft  2008    1200
           2009    1400
           2010    1600
Name: Revenue, dtype: int64

In [103]:
multiindex_df['Revenue'].apply(lambda x: x*2 if x%6==0 else x)

Company    Year
Google     2008     600
           2009     400
           2010     500
Microsoft  2008    1200
           2009     700
           2010     800
Name: Revenue, dtype: int64

In [104]:
air_df=pd.read_csv('C:\\Users\\sree\\Desktop\\jupyter\\data science\\AirQualityUCI.csv')

In [105]:
air_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9357 entries, 0 to 9356
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   object
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   int64
 4   NMHC(GT)       9357 non-null   int64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   int64
 7   NOx(GT)        9357 non-null   int64
 8   PT08.S3(NOx)   9357 non-null   int64
 9   NO2(GT)        9357 non-null   int64
 10  PT08.S4(NO2)   9357 non-null   int64
 11  PT08.S5(O3)    9357 non-null   int64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
dtypes: float64(5), int64(8), object(2)
memory usage: 1023.5+ KB

In [106]:
air_df.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,3/10/2004,18:00:00,2.6,1360,150,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578
1,3/10/2004,19:00:00,2.0,1292,112,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255
2,3/10/2004,20:00:00,2.2,1402,88,9.0,939,131,1140,114,1555,1074,11.9,54.0,0.7502
3,3/10/2004,21:00:00,2.2,1376,80,9.2,948,172,1092,122,1584,1203,11.0,60.0,0.7867
4,3/10/2004,22:00:00,1.6,1272,51,6.5,836,131,1205,116,1490,1110,11.2,59.6,0.7888

In [107]:
air_df.describe()

,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
count,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000
mean,-34.207524,1048.990061,-159.090093,1.865683,894.595276,168.616971,794.990168,58.148873,1391.479641,975.072032,9.778305,39.485380,-6.837604
std,77.657170,329.832710,139.789093,41.380206,342.333252,257.433866,321.993552,126.940455,467.210125,456.938184,43.203623,51.216145,38.976670
min,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000
25%,0.600000,921.000000,-200.000000,4.000000,711.000000,50.000000,637.000000,53.000000,1185.000000,700.000000,10.900000,34.100000,0.692300
50%,1.500000,1053.000000,-200.000000,7.900000,895.000000,141.000000,794.000000,96.000000,1446.000000,942.000000,17.200000,48.600000,0.976800
75%,2.600000,1221.000000,-200.000000,13.600000,1105.000000,284.000000,960.000000,133.000000,1662.000000,1255.000000,24.100000,61.900000,1.296200
max,11.900000,2040.000000,1189.000000,63.700000,2214.000000,1479.000000,2683.000000,340.000000,2775.000000,2523.000000,44.600000,88.700000,2.231000